//  Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

//  Console.WriteLine("Введите трех значное число");
//  int x = Convert.ToInt32(Console.ReadLine());

//  int Ostatok =(x / 10) % 10;

//  Console.Write($"Последняя цифра числа {x} это {Ostatok}");

// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// Console.WriteLine("Введите число");
// int x = Convert.ToInt32(Console.ReadLine());

// int Ostatok =(x % 1000)/100;
// {
//     if (x>99)
//     Console.WriteLine($"{x} это-> {Ostatok}");
//     else
//     Console.WriteLine($"{x}-> третьей цифры нет");
// }

// Не понял как сделать, чтоб считало не с права на лева, а наоборот как в примерах?      

//  Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет 

// bool week(int num)
// {
//     if (num>=6)
//     {
//         return true;
//     }
//     else
//         return false;
// }
// Console.WriteLine("Введитe цифру, обозначающую день недели:");
// int num = Convert.ToInt32(Console.ReadLine());
// bool result = week(num);
// Console.WriteLine(result);
     

        














